<h1 style="background-color:orange;padding:10px 0 10px 10px;display:inline;">Reading,Writing CSV files</h1>

In [1]:
import pandas as pd

## If header is extra:
### header=1 or skiprows=1
## If header is missing:
### header=None , names=["Class","Roll#","Marks"]
## If dataset is larger , then you want to load few rows
### nrows=</no of rows/>
## Replacing values with null values
### na_values=["not available"] or na_values={"revenue":[-1]}

In [36]:
df = pd.read_csv("Csv_file.csv",header=None,names=["Brand of shoes","number of shoes","price of shoes"])
df

  Brand of shoes  number of shoes  price of shoes
0            Zoo               12             300
1         Unalti               10             400
2          Nikee               11             350
3         Sparke               13             550
4         Hebton               10             540
5       Helloton               12             400
6           Mecr               11             800

## For writing csv:
### df.to_csv("<name of csv file/>" , header=False(for not importing header) , columns=["brand","price"] , index=False)

In [33]:
df.to_csv("new_csv_file",index=False,columns=['Brand of shoes'])

<h1 style="background-color:orange;padding:10px 0 10px 10px;display:inline;">Reading,Writing EXCEL files</h1>

In [53]:
df = pd.read_excel("Excel_file.xlsx","Sheet2")
df

         Name  class  gender  age
0         Ali     12    Male   22
1        Sana     13  Female   19
2  Bilal Khan     12    Male   20
3    Abdullah     14    Male   19
4      Fatima     14  Female   20
5  Hassan Ali     15    Male   23
6       Wania     12  Female   17
7      Maryam     14  Female   20
8      Faizan     16    Male   24

In [43]:
df.to_excel("new_excel_file.xlsx",sheet_name="Students Information",index=False,startrow=2,startcol=2)

## Writing multiple dataframes to multiple sheets

In [49]:
df_stocks = pd.DataFrame({
    "Brand":["Zelac","Muitar","Nickee","Heaven","Flikker"],
    "Rating":[4,4.5,5,5,3.9],
    "Customers":["Millions","Billions","Billions","Billions","Lac"]
})
df_studentRecord = pd.DataFrame({
    "Name":["Ali","Abdullah","Sana"],
    "Gender":["Male","Male","Female"],
    "Education":["Matric","Intermediation","Graduation"]
})

In [51]:
with pd.ExcelWriter("Stocks and Student Record.xlsx") as write:
    df_stocks.to_excel(write,sheet_name="stocks",index=False),
    df_studentRecord.to_excel(write,sheet_name="students record",index=False)